In [1]:
import pandas as pd

In [2]:
l1 = {
    "name": ["John", "Nate", "Fred"],
    "job": ["teacher", "student", "developer"]
}
l2 = {
    "name": ["Ed", "Jack", "Ted"],
    "job": ["dentist", "farmer", "designer"]
}
l3 = {
    "name": ["John", "Nate", "Fred"],
    "job": ["teacher", "student", "developer"]
}
l4 = {
    "age": [25, 30, 45],
    "country": ["U.S", "U.K", "Korea"]
}

df1 = pd.DataFrame(l1)
df2 = pd.DataFrame(l2)

In [3]:
df1

   name        job
0  John    teacher
1  Nate    student
2  Fred  developer

In [4]:
df2

   name       job
0    Ed   dentist
1  Jack    farmer
2   Ted  designer

#### df1, df2 합치기 - 열로

In [5]:
# 첫번째 방법

result = pd.concat([df1, df2])
result

   name        job
0  John    teacher
1  Nate    student
2  Fred  developer
0    Ed    dentist
1  Jack     farmer
2   Ted   designer

In [6]:
# 위에서 문제는 인덱스가 중복으로 들어감 - 변경

result = pd.concat([df1, df2], ignore_index=True)
result

   name        job
0  John    teacher
1  Nate    student
2  Fred  developer
3    Ed    dentist
4  Jack     farmer
5   Ted   designer

In [7]:
# 두 번째 방법

result = df1.append(df2)
result

   name        job
0  John    teacher
1  Nate    student
2  Fred  developer
0    Ed    dentist
1  Jack     farmer
2   Ted   designer

In [8]:
# index 중복 해제

result = df1.append(df2, ignore_index=True)
result

   name        job
0  John    teacher
1  Nate    student
2  Fred  developer
3    Ed    dentist
4  Jack     farmer
5   Ted   designer

#### df1, df2 합치기 - 행으로

In [9]:
df3 = pd.DataFrame(l3)
df4 = pd.DataFrame(l4)

In [10]:
df3

   name        job
0  John    teacher
1  Nate    student
2  Fred  developer

In [11]:
df4

   age country
0   25     U.S
1   30     U.K
2   45   Korea

In [13]:
result = pd.concat([df3, df4], axis=1, ignore_index=True)
result

      0          1   2      3
0  John    teacher  25    U.S
1  Nate    student  30    U.K
2  Fred  developer  45  Korea

#### 리스트 합치기

In [14]:
label = [1,2,3,4,5]
prediction = [1,2,2,4,4]

In [15]:
comparison = pd.DataFrame({"label":label, "prddiction":prediction})
comparison

   label  prddiction
0      1           1
1      2           2
2      3           2
3      4           4
4      5           4